onec-mid-base-11/src/Documents/НЕТ_Доставка/НЕТ_Доставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НЕТ_Доставка</name>
  <comment>//++ Доработка Нетология 24.03.2025</comment>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/НЕТ_Доставка/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда		
		ЗаполнитьНаОснованииРеализацииТоваровУслуг(ДанныеЗаполнения);		
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииРеализацииТоваровУслуг(ДанныеЗаполнения)
	
	Договор = ДанныеЗаполнения.Договор;
	Контрагент = ДанныеЗаполнения.Контрагент;
	Организация = ДанныеЗаполнения.Организация;
	Основание = ДанныеЗаполнения.Ссылка;
	
	Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
		НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
	КонецЦикла;
	
КонецПроцедуры
